Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateExplicitCrease Property
 Cannot create a new split line based on the picked support.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateExplicitCrease { get; }
Public Shared ReadOnly Property CannotCreateExplicitCrease As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateExplicitCrease {
	FailureDefinitionId^ get ();
}
static member CannotCreateExplicitCrease : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace